{
  "locale": "de",
  "translations": {
    "7799369090342978974": "Dieser Abschnitt ist in der gewählten Sprache nicht verfügbar. Daher wird er stattdessen in der Originalsprache angezeigt.",
    "8439955599488894226": "Datenschutzerklärung",
    "7682273657615620563": "Meine Projekte",
    "3585106651990933776": "Hier sind einige persönliche Projekte, welche ich in meiner Freizeit entwickelt habe",
    "3287964785700504599": "Das Verwaltungsportal meiner Universität war nicht sehr angenehm zu bedienen und hatte keine mobile App. Also habe ich meine eigene App entwickelt, welche öffentlich zugängliche Api-Endpunkte und Web-Scraping der gerenderten Html-Dokumente verwendet, um alle gewünschten Daten zu erhalten und sie in einer eleganten Weise darzustellen. Zusätzlich habe ich auch einige Qol-Funktionen wie Caching von Anmeldedaten und Offline-Anzeige hinzugefügt. Diese Anwendung benötigt keinen externen Server (außer dem Universitätsserver), um zu funktionieren, da sie alle Daten lokal speichert.",
    "2817185152111463154": "Dies ist die aktuelle Webseite, welche meine Projekte und Fähigkeiten als Entwickler vorstellt. Das verwendete Framework ist Qwik (bzw. Qwick-City), welches eine moderne herangehensweise an effiziente Webseiten bietet.",
    "8317015806789370167": "Dies ist mein allererstes Projekt, welches mich in die Programmierung eingeführt hat. Es war ziemlich schwierig, etwas auf einem Taschenrechner zu programmieren, vor allem wenn es fast keine Anleitungen gibt, aber irgendwie habe ich es zum Laufen gebracht. Ich wollte nicht die onboard Programmiersprache des Taschenrechners verwenden, da diese nur ein Basic-Dialekt darstellte. Daher habe ich mich für das etwas erweiterte Casio SDK entschieden (was nicht einfach zu finden und zu verstehen war). Dies war allerdings eine Herausforderung, da ich das Programm in C schreiben musste, das ich noch nie zuvor verwendet hatte. Da es mein erstes Projekt war, ist der Code ziemlich chaotisch und unorganisiert, aber es hat trotzdem Spaß gemacht, etwas Eigenes zu erstellen.",
    "4494490281275858531": "Dieses Projekt ist eine sehr einfache und naive Implementierung eines neuronalen Netzes in Rust. Es hat mir geholfen, die Grundlagen neuronaler Netze und deren Funktionsweise zu lernen. Die Implementierung ist nicht optimiert und nur für Lehrzwecke gedacht. Aber für jeden, der die Grundlagen neuronaler Netze verstehen will und Rust kennt, ist dies ein guter Ausgangspunkt. Sie enthält alle Funktionen, die zum Trainieren eines neuronalen Netzes auf der Grundlage des MNIST-Datensatzes für die Erkennung handgeschriebener Ziffern benötigt werden.",
    "7922989125096435449": "Kontakt",
    "7325080221089421067": "Wenn Sie Fragen oder Anregungen haben oder einfach nur Hallo sagen wollen, können Sie sich gerne melden!",
    "7015220428297107423": "Schreiben Sie mir einfach eine E-Mail an",
    "2818766806508018201": "oder verwenden Sie das untenstehende Formular.",
    "7751010942038334793": "Blog",
    "6560637039747160338": "Willkommen in meinem Blog! Hier teile ich meine Gedanken, Erfahrungen und Einsichten zu verschiedenen Themen rund um Technik, Programmierung und mehr.",
    "7608999710089554177": "Bleiben Sie auf dem Laufenden und wenden Sie sich an mich, wenn Sie Fragen oder Anregungen haben!",
    "8953033926734869941": "Name",
    "8174256936466972851": "Geben Sie Ihren Namen ein",
    "4768749765465246664": "E-Mail",
    "1642661481481799039": "Geben Sie Ihre E-Mail Adresse ein",
    "8066608938393600549": "Nachricht",
    "5328369685727352899": "Geben Sie Ihre Nachricht ein",
    "6490688569532630280": "Senden Sie",
    "6203914560496725242": "Blog-Eintrag ansehen",
    "6480390330423300875": "Quelle anzeigen",
    "3698445625503805487": "Dies ist mein persönliches Portfolio.",
    "2821179408673282599": "Startseite",
    "1726363342938046830": "Über",
    "7091571651222742304": "Projekte",
    "7178052848163010408": "Ich bin",
    "2405286474181510887": "Ein",
    "4513704550431982162": "Entwickler",
    "3900745377647813820": "Mit einer Leidenschaft für das Entwickeln von allem, was mir in den Sinn kommt.",
    "1949800099101277248": "Sprachen",
    "6783285406926776467": "Rahmenwerke",
    "1684734235599362204": "Werkzeuge",
    "2079014792649220912": "Hey! Ich bin Fabian Schuster, ein {$PH} jähriger Softwareentwickler aus Deutschland. Derzeit arbeite ich als Softwareentwickler bei SPEKTRA Schwingungstechnik und Akkustik GmbH und übernehme dort eine Vielzahl von Aufgaben. Mein Interesse am Programmieren begann vor Jahren, als ich in der Schule mein erstes Programm für einen grafischen Taschenrechner geschrieben habe. Seitdem ist meine Leidenschaft für das Programmieren nur noch stärker geworden, was dazu führte, dass ich mich mit verschiedenen Programmiersprachen und Technologien auseinandersetzte. Meine Erfahrung reicht von kleinen, eleganten Lösungen bis hin zu komplexen, groß angelegten Anwendungen für eine Vielzahl unterschiedlicher Bereiche.",
    "8919424385544469216": "Für mich ist das Programmieren mehr als nur das Schreiben von Code. Es ist ein Weg, Systeme zu entwickeln, die nicht nur funktionieren, sondern auch effizient, wartbar und - was am wichtigsten ist - elegant sind. Es geht darum, ständig aus jedem gelösten Problem zu lernen und sich als Entwickler ständig weiterzuentwickeln.",
    "8530795838570306087": "Außerhalb der Arbeit tüftle ich wahrscheinlich immer noch an eigenen Projekten oder erforsche neue Technologien. Ich arbeite gerne an persönlichen Projekten und probiere verschiedene Open-Source-Projekte aus, um meine Fähigkeiten zu erweitern. Ich achte aber darauf Pausen zu machen, um meinen anderen Interessen nachzugehen, z.B. Mountainbiken, Trainieren oder mich mit Freunden zu treffen. Auf diese Weise bleibe ich nicht nur geistig, sondern auch körperlich in Form.",
    "1504780695575590002": "Danke fürs Vorbeischauen. Wenn Sie Fragen haben oder einfach nur plaudern möchten, wenden Sie sich bitte an",
    "2613604703505356357": "mich.",
    "4342625008558026850": "Fertigkeiten",
    "257667530402555405": "Die folgenden Fertigkeiten basieren auf meinem derzeitigen Wissen und meiner Erfahrung (Stand: {$PH}). Es gibt einen Algorithmus, der versucht, den aktuellen Kenntnisstand jeder Fertigkeit auf der Grundlage der Anwendungshäufigkeit zu schätzen. Dieser Algorithmus ist jedoch nicht perfekt und spiegelt möglicherweise nicht genau meine tatsächlichen Fähigkeiten wider.",
    "6018686961415145811": "Über mich"
  }
}