{
  "locale": "de",
  "translations": {
    "7178052848163010408": "Ich bin",
    "2405286474181510887": "Ein",
    "4513704550431982162": "Entwickler",
    "3900745377647813820": "Mit einer Vorliebe für die Gestaltung von allem, was mir in den Sinn kommt.",
    "863607411088278375": "Ich bin noch am Überlegen, was ich hier reinstellen soll :D",
    "3698445625503805487": "Dies ist mein persönliches Portfolio, das ich mit Sorgfalt erstellt habe.",
    "7682273657615620563": "Meine Projekte",
    "3585106651990933776": "Im Folgenden finden Sie einige persönliche Projekte, die ich in meiner Freizeit außerhalb meiner beruflichen oder akademischen Tätigkeit entwickelt habe",
    "3287964785700504599": "\n          Das Verwaltungsportal meiner Universität war nicht sehr angenehm zu bedienen und hatte keine mobile App.\n          Also beschloss ich, meine eigene App zu programmieren, die eine Kombination aus öffentlich zugänglichen Api-Endpunkten\n          und dem Scraping der gerenderten Html-Dokumente, um alle gewünschten Daten zu erhalten und sie in einer\n          eleganten Weise darzustellen. Ich habe auch einige Qol-Funktionen wie Caching von Anmeldeinformationen und Offline-Anzeige hinzugefügt.\n          Diese Anwendung benötigt keinen externen Server (außer dem Universitätsserver), um zu funktionieren, da sie alle Daten lokal speichert.\n          alle Daten lokal speichert.\n        ",
    "2817185152111463154": "\n          Dies ist die Website, die Sie sich gerade ansehen. Sie stellt meine Projekte und Fähigkeiten als Entwickler vor.\n          Die Website wurde mit Qwik erstellt, einem modernen Framework für die Erstellung schneller und effizienter Webanwendungen.\n        ",
    "8317015806789370167": "\n          Dies ist mein allererstes Projekt, das erwähnenswert ist. Es war ein ziemlicher Kampf, etwas auf einem\n          auf einem Taschenrechner zu programmieren, vor allem wenn es fast keine Anleitungen gibt. Aber irgendwie habe ich es zum Laufen gebracht.\n          Ich wollte nicht die Programmiersprache des Taschenrechners verwenden, da sie sehr einfach und voller Fehler ist.\n          Deshalb entschied ich mich, das erweiterte Casio SDK für mein Projekt zu verwenden (was nicht einfach zu finden und zu verstehen war).\n          Ein weiterer Nachteil war, dass ich das Programm in C programmieren musste, das ich noch nie zuvor benutzt hatte, so dass ich es erst lernen musste.\n          Da dies mein erstes Projekt war, ist der Code nicht sehr gut organisiert, aber er hat funktioniert, was ziemlich toll ist.\n        ",
    "3723629495617941004": "\n          Dieses Projekt ist eine sehr einfache und naive Implementierung eines neuronalen Netzes in Rust. Es war eine unterhaltsame\n          über die Grundlagen neuronaler Netze und deren Funktionsweise zu lernen. Die Implementierung ist nicht optimiert\n          und ist nur für Lehrzwecke gedacht. Aber für jeden, der die Grundlagen von neuronalen Netzen verstehen will und Rust\n          Neuronale Netze verstehen will und Rust kennt, ist dies ein guter Ausgangspunkt. Sie enthält alle Funktionen, die zum Trainieren\n          ein neuronales Netz auf der Grundlage des MNIST-Datensatzes für die Erkennung handgeschriebener Ziffern zu trainieren.\n        ",
    "2821179408673282599": "Startseite",
    "1726363342938046830": "Über mich",
    "7091571651222742304": "Projekte",
    "7751010942038334793": "Blog",
    "7922989125096435449": "Kontakt",
    "7325080221089421067": "Wenn Sie Fragen oder Anregungen haben oder einfach nur Hallo sagen wollen, können Sie sich gerne melden!",
    "7015220428297107423": "Schreiben Sie mir einfach eine E-Mail an",
    "2818766806508018201": "oder verwenden Sie das untenstehende Formular.",
    "6203914560496725242": "Bericht ansehen",
    "6480390330423300875": "Quelle anzeigen",
    "8953033926734869941": "Name",
    "4768749765465246664": "E-Mail",
    "8066608938393600549": "Nachricht",
    "6490688569532630280": "Senden Sie",
    "8439955599488894226": "Datenschutzerklärung",
    "495673960612763191": "Hallo zusammen! Ich bin Fabian Schuster, ein",
    "6101192876454975991": "jähriger Softwareentwickler aus Deutschland. Derzeit studiere ich\n            ein duales Studium der Informatik, das theoretisches Wissen mit praktischer Erfahrung in der\n            Erfahrung in der Software-Entwicklung. Mein Interesse am Programmieren begann vor Jahren, als ich in der Schule mein erstes\n            Programm für einen grafischen Taschenrechner in der Schule. Seitdem ist meine Leidenschaft für das Programmieren nur noch stärker geworden,\n            was mich dazu brachte, verschiedene Programmiersprachen und Technologien zu erforschen. Meine Erfahrung reicht von\n            kleinen, eleganten Lösungen bis hin zu komplexen, groß angelegten Anwendungen für eine Vielzahl unterschiedlicher Bereiche.",
    "8919424385544469216": "\n              Für mich ist das Programmieren mehr als nur das Schreiben von Codezeilen. Es ist ein Weg, Systeme zu entwickeln, die nicht nur\n              die nicht nur funktionieren, sondern auch effizient, wartbar und - was am wichtigsten ist - elegant sind. Es geht darum, ständig aus jedem gelösten Problem zu lernen\n              aus jedem gelösten Problem zu lernen und sich als Entwickler ständig weiterzuentwickeln.\n            ",
    "8530795838570306087": "\n              Außerhalb der Arbeit tüftle ich wahrscheinlich immer noch an Codes oder erforsche neue Technologien. Ich arbeite gerne\n              an persönlichen Projekten und probiere verschiedene Open-Source-Projekte aus, um meine Fähigkeiten zu erweitern. Ich achte aber auch\n              Pausen ein, um meinen anderen Interessen nachzugehen, z. B. Mountainbiken, Sport treiben\n              oder mich mit Freunden zu treffen. Auf diese Weise bleibe ich nicht nur geistig, sondern auch körperlich in Form.\n            ",
    "1504780695575590002": "Danke fürs Vorbeischauen. Wenn Sie Fragen haben oder einfach nur plaudern möchten, wenden Sie sich bitte an",
    "2613604703505356357": "die Hand reichen.",
    "4342625008558026850": "Fertigkeiten",
    "443470100631535582": "Die folgenden Fähigkeiten beruhen auf meinen derzeitigen Kenntnissen und Erfahrungen zum Zeitpunkt",
    "1878185136480107101": "Es gibt einen Algorithmus, der versucht, die aktuelle Stufe jeder Fertigkeit auf der Grundlage der\n          je nachdem, wie oft ich sie benutze. Dieser Algorithmus ist jedoch nicht perfekt und spiegelt möglicherweise nicht genau meine tatsächlichen Fähigkeiten wider.",
    "6560637039747160338": "Willkommen in meinem Blog! Hier teile ich meine Gedanken, Erfahrungen und Einsichten zu verschiedenen Themen rund um Technik, Programmierung und mehr.",
    "7608999710089554177": "Bleiben Sie auf dem Laufenden und wenden Sie sich an uns, wenn Sie Fragen oder Anregungen haben!",
    "8174256936466972851": "Geben Sie Ihren Namen ein",
    "1642661481481799039": "Geben Sie Ihre E-Mail Adresse ein",
    "5328369685727352899": "Geben Sie Ihre Nachricht ein",
    "4494490281275858531": "\n          Dieses Projekt ist eine sehr einfache und naive Implementierung eines neuronalen Netzes in Rust. Es war eine unterhaltsame\n          über die Grundlagen neuronaler Netze und deren Funktionsweise zu lernen. Die Implementierung ist nicht optimiert\n          und ist nur für Lehrzwecke gedacht. Aber für jeden, der die Grundlagen von neuronalen Netzen verstehen will und Rust\n          Neuronale Netze verstehen will und Rust kennt, ist dies ein guter Ausgangspunkt. Sie enthält alle Funktionen, die zum Trainieren\n          ein neuronales Netz auf der Grundlage des MNIST-Datensatzes für die Erkennung handgeschriebener Ziffern zu trainieren.\n        "
  }
}