{
  "locale": "en",
  "translations": {
    "8439955599488894226": "Privacy Policy",
    "2821179408673282599": "Home",
    "1726363342938046830": "About",
    "7091571651222742304": "Projects",
    "7751010942038334793": "Blog",
    "7922989125096435449": "Contact",
    "7178052848163010408": "I'm",
    "2405286474181510887": "A",
    "4513704550431982162": "Developer",
    "3900745377647813820": "With a love for creating everything that comes to mind.",
    "6560637039747160338": "Welcome to my blog! Here I share my thoughts, experiences, and insights on various topics related to technology, programming, and more.",
    "7608999710089554177": "Stay tuned for updates and feel free to reach out if you have any questions or suggestions!",
    "7325080221089421067": "If you have any questions, suggestions, or just want to say hello, feel free to reach out!",
    "7015220428297107423": "Simply write me an email to",
    "2818766806508018201": "or use the form below.",
    "7682273657615620563": "My Projects",
    "3585106651990933776": "Below are a few personal projects I've developed in my free time, outside of professional or academic work",
    "3287964785700504599": "\n          The management portal of my university was not very nice to work with and had no mobile app.\n          So I decided to code my own, which uses a combination of publicly available api endpoints\n          and scraping the rendered html documents to get all the data I want and display them in an\n          elegant fashion. I also added some qol features like credential caching and offline viewing.\n          This app doesn't require any external server (beside the university-server) to work as it saves\n          all data locally.\n        ",
    "2817185152111463154": "\n          This is the website you are currently looking at. It showcases my projects and skills as a developer.\n          The website is built using Qwik, a modern framework for building fast and efficient web applications.\n        ",
    "8317015806789370167": "\n          This is my first ever project which is worth mentioning. It was quite a struggle to code something\n          on a calculator, especially if there are nearly no tutorials. But somehow I got it working.\n          I didn't want to use the programming language inside the Calculator, because it's really simple and full of bugs.\n          That's why I decided to use the advanced Casio SDK for my project (which wasn't easy to find and understand).\n          Another unfortunate thing was, that I had to code it in C, which I never used before, so I had to learn it.\n          As this was my first project, the code isn't very organized but it worked which is pretty awesome.\n        ",
    "4494490281275858531": "\n          This project is a very simple and naive implementation of a neural network in Rust. It was a fun\n          way to learn about the basics of neural networks and how they work. The implementation is not optimized\n          and is meant for educational purposes only. But for anyone who wants to understand the basics of neural\n          networks and knows Rust, this is a good starting point. It includes all functionality needed to train\n          a neural network based on the MNIST dataset for handwritten digit recognition.\n        ",
    "8953033926734869941": "Name",
    "8174256936466972851": "Enter your Name",
    "4768749765465246664": "Email",
    "1642661481481799039": "Enter your Email Address",
    "8066608938393600549": "Message",
    "5328369685727352899": "Enter your Message",
    "6490688569532630280": "Send",
    "1949800099101277248": "Languages",
    "6783285406926776467": "Frameworks",
    "1684734235599362204": "Tools",
    "495673960612763191": "Hey there! I'm Fabian Schuster, a",
    "9183800215365512285": "year old software developer from Germany. Currently, I'm\n            working as a Software Developer at SPEKTRA, doing a variety of tasks. My interest in programming began years ago when building my first\n            program for a graphics calculator in school. Since then, my passion for coding only grew stronger,\n            leading me to explore various programming languages and technologies. My experience ranges from\n            small, elegant solutions to complex, large-scale applications for a variety of different areas.",
    "8919424385544469216": "\n              For me, coding became more than just writing lines of code. It is a way to build systems that not only\n              work, but also are efficient, maintainable and most importantly, elegant. It is about constantly learning\n              from every problem solved and continuously evolving as a developer.\n            ",
    "8530795838570306087": "\n              Outside of work, I'm probably still tinkering with code or exploring new technologies. I enjoy working\n              on personal projects and trying out various open-source projects to broaden my skill set. However I also\n              make sure to take breaks and spend time pursuing my other interests, such as mountain biking, working out\n              or meeting up with friends. That way I can stay in shape not just mentally but also physically.\n            ",
    "1504780695575590002": "Thanks for stopping by. If you have any questions or just want to chat, feel free to",
    "2613604703505356357": "reach out.",
    "4342625008558026850": "Skills",
    "443470100631535582": "The following skills are based on my current knowledge and experience as of",
    "1878185136480107101": "There is an algorithm in place that tries to estimate the current proficiency level of each skill based\n          on how often I use it. However it's not perfect and may not reflect my actual proficiency accurately.",
    "3698445625503805487": "This is my personal portfolio built with care.",
    "7799369090342978974": "This section is not available in your selected language. So it's shown in the original language instead.",
    "6203914560496725242": "View write-up",
    "6480390330423300875": "View source"
  }
}